/*
 Localizable.strings
 GT-Buses
 
 Created by Alex Perez on 11/22/14.
 Copyright (c) 2014 Alex Perez. All rights reserved.
 */


/* Main Title */
"TITLE" = "GT Buses";


/* Button to open Settings screen */
"SETTINGS_BUTTON" = "Settings";

/* Placeholder text for search bar */
"SEARCH_PLACEHOLDER" = "Search";

/* Displayed above search bar */
"SEARCH_PROMPT" = "Search for Building:";

/* Search returned no results */
"NO_RESULTS_FOUND" = "No Results Found";


/* 400 Bad request error */
"BAD_REQUEST_ERROR" = "Bad Request";

/* 404 Not found */
"RESOURCE_ERROR" = "Resource Error";

/* 500 Internal server error */
"INTERNAL_SERVER_ERROR" = "Internal Server Error";

/* 503 Timed out */
"TIMED_OUT_ERROR" = "Timed Out";

/* 1008/1009 No internet connection */
"NO_INTERNET_ERROR" = "No Internet Connection";

/* Error parsing response xml */
"PARSING_ERROR" = "Parsing Error";

/* Nextubs returned an error */
"NEXTBUS_ERROR" = "Nextbus Error";

/* Invalid Nextbus agency */
"NEXTBUS_INVALID_AGNECY_ERROR" = "Invalid Agency";

/* Default HTTP response error */
"DEFAULT_ERROR" = "Error Connecting";



/* No predictions for stop */
"NO_PREDICTIONS" = "No Predictions";

/* In x, y, ... */
"PREDICTIONS_IN" = "In ";

/* At x, y, ... */
"PREDICTIONS_AT" = "At ";


/* Select color prompt */
"SELECT_COLOR" = "Select Color:";

/* Cancel */
"CANCEL" = "Cancel";



/* Settings title */
"SETTINGS" = "Settings";

/* Predictions setting title */
"PREDICTIONS_SETTING" = "Predictions:";

/* Support button */
"SUPPORT" = "Support";

/* Review app button */
"REVIEW_APP" = "Review App";

/* Update now button */
"UPDATE_NOW" = "Update Now";

/* Update available button */
"UPDATE_AVAILABLE" = "Update available!";

/* Toggle for showing bus identifiers */
"SHOW_BUS_IDENTIFIERS" = "Show Bus Identifiers";

/* Copyright */
"COPYRIGHT" = "Copyright © 2015 by Alex Perez";

/* Toggle routes */
"TOGGLE_ROUTES" = "Toggle Routes";

/* Select agency */
"SELECT_AGENCY" = "Select Agency";

/* No agency selected */
"NO_AGENCY_SELECTED" = "No Agency Selected";

/* Disable ads */
"DISABLE_ADS" = "Disable Ads";

/* No saved routes */
"NO_SAVED_ROUTES" = "No Saved Routes";


/* Mail failed alert tile */
"MESSAGE_FAILED" = "Message Failed";

/* Mail failed alert message */
"MESSAGE_FAILED_TO_SEND" = "Your message has failed to send.";

/* Mail failed alert dismiss */
"MESSAGE_DISMISS" = "Dismiss";




/* Favorites section title */
"FAVORITES_SECTION" = "Favorites:";

/* No favorites added */
"NO_FAVORITES_ADDED" = "No Favorites Added.";



/* Nearby section title */
"NEARBY_SECTION" = "Nearby:";

/* Location sevices are disabled */
"LOCATION_SERVICES_DISABLED" = "Location services disabled.";

/* No nearby stops */
"NO_NEARBY_STOPS" = "No nearby stops.";

/* No route config */
"NO_ROUTE_CONFIG" = "No route config.";

/* No location data */
"NO_LOCATION_DATA" = "No location data. Please ensure location services are enabled.";



/* Buildings data is empty */
"NO_BUILDINGS_DATA" = "No Buildings Data";

/* Copy the address */
"COPY_ADDRESS" = "Copy Address";

/* Building has no address or phone number */
"NO_ADDRESS_OR_PHONE" = "No Address or Phone";


/* Blue Color */
"BLUE" = "Blue";

/* Red Color */
"RED" = "Red";

/* Green Color */
"GREEN" = "Green";

/* Pink Color */
"PINK" = "Pink";

/* Yellow Color */
"YELLOW" = "Yellow";

/* Black Color */
"BLACK" = "Black";

/* Failed to retrieve agency list */
"AGENCY_LIST_ERROR" = "Error loading agency list: ";
